from db import Database
db = Database()

#----------------------------------------------------------------------------------------------------------------

# Token бота
TOKEN = "5714593221:AAE_vzYtjwfa0h7RlDO4scezpxsGQYIDWCg"
#----------------------------------------------------------------------------------------------------------------

# ID на аккаунт админа
admins = [
	1030874842,
	745814407

]

#----------------------------------------------------------------------------------------------------------------

# Каналы на каторые нужно быть подписанными ['Имя, которое будет выводиться на кнопке', 'ID канала', 'ссылка на канал']
# Бот должен быть админом в этих каналах, чтобы проверить наличие подписки
CHANNELS = [
	['Channel 1', '-1001734480359', 'https://t.me/Armenian_Sasha']
]

#----------------------------------------------------------------------------------------------------------------

# Сообщение которое будет выводиться если не подписал на какой-то канал
NOT_SUB_MESSAGE = 'You not subscribe channels!'



def questionnaire(variable):
	questionnaire_text = f"""Анкета собеседника:
Имя: {db.get_name(variable)}
Возраст: {db.get_age(variable)}
Текст: {db.get_text(variable)}
Пол: {db.get_gender(variable)}
Рейтинг:
Лайки👍: {db.get_like(variable)}
Дизлайки👎: {db.get_dislike(variable)}
Количество диалогов: {db.get_num_chats(variable)}
"""
	return questionnaire_text

